In [2]:
# import the libraries
import sqlite3
import pandas as pd

# create a connection
conn = sqlite3.connect("databases/takeaway.db")

Tabla Restaurants

In [10]:
query1 = """SELECT primarySlug, restaurant_id, name, city
           FROM restaurants;
"""

df_1  = pd.read_sql_query (query1, conn)
print(df_1)

                   primarySlug restaurant_id                    name      city
0                   pasta-pino      ONPO70QN              Pasta Pino  Mouscron
1            da-barone-et-fils      00N7P37N       Da Barone et Fils    Neupré
2                pizza-gustosa      O031NNN1           Pizza Gustosa     Awans
3     la-brezza-nova-rocourt-1      R0P3NPQN  La Brezza Nova Rocourt     Liège
4                la-storia-ans      R5R5QNQN               La Storia     Liège
...                        ...           ...                     ...       ...
4066              frituur-snax      R5ON75QN            Frituur Snax    Lierde
4067                pitta-dorp      R7Q31OQN              Pitta Dorp  Haaltert
4068       nino-grill-ninove-1      RN0R15QN              Nino Grill    Ninove
4069            the-salad-spot      RORRP1QN          The Salad Spot    Ninove
4070                     titis      RR3Q15QN                  Titi's   Enghien

[4071 rows x 4 columns]

Tabla Categories

In [6]:
query2 = """SELECT *
           FROM categories
           ;
"""

df_2  = pd.read_sql_query (query2, conn)
print(df_2)

               id        restaurant_id                  name     item_id
0       RPR1QNQO1   barouche-kortemunt              To share  R0QR505QP1
1       RPR1QNQO1   barouche-kortemunt              To share  R3QR505QP1
2       RRR1QNQO1   barouche-kortemunt                  Pita  RPQR505QP1
3       RRR1QNQO1   barouche-kortemunt                  Pita  RRQR505QP1
4       RRR1QNQO1   barouche-kortemunt                  Pita  RNRR505QP1
...           ...                  ...                   ...         ...
403008  O0330QQ01  frittur-sint-rochus           Frisdranken  OQ1517NR11
403009  O0330QQ01  frittur-sint-rochus           Frisdranken  O1N517NR11
403010  O0330QQ01  frittur-sint-rochus           Frisdranken  OON517NR11
403011  O0330QQ01  frittur-sint-rochus           Frisdranken  O33517NR11
403012  OQ33RRQ01  frittur-sint-rochus  Alcoholische dranken  O001O3OR11

[403013 rows x 4 columns]

Tabla categories_restaurants

In [5]:
query3 = """SELECT *
           FROM categories_restaurants
           ;
"""

df_3  = pd.read_sql_query (query3, conn)
print(df_3)

                   category_id      restaurant_id
0                   pasta_1614         pasta-pino
1                   italian_21         pasta-pino
2                    other_101         pasta-pino
3            italian-pizza_271  da-barone-et-fils
4            italian-pizza_271      pizza-gustosa
...                        ...                ...
11652              salads_1456     the-salad-spot
11653  smoothie-and-juice_1664     the-salad-spot
11654                wrap_1416     the-salad-spot
11655             burgers_1984              titis
11656               fries_1734              titis

[11657 rows x 2 columns]

Tabla menuItems

In [9]:
query4 = """SELECT *
            FROM menuItems
           ;
            """ 

df_4 = pd.read_sql_query (query4, conn) 
print(df_4)

                primarySlug          id              name  \
0        barouche-kortemunt  R0QR505QP1        Hummus dip
1        barouche-kortemunt  R3QR505QP1      Seasonal dip
2        barouche-kortemunt  RPQR505QP1          BarBacon
3        barouche-kortemunt  RRQR505QP1       Chick(p)ita
4        barouche-kortemunt  RNRR505QP1    Steak Republic
...                     ...         ...               ...
403008  frittur-sint-rochus  OQ1517NR11  Lipton Green Tea
403009  frittur-sint-rochus  O1N517NR11  Kinder cola 25cl
403010  frittur-sint-rochus  OON517NR11     Kinder Fristi
403011  frittur-sint-rochus  O33517NR11     Red Bull 25cl
403012  frittur-sint-rochus  O001O3OR11           Jupiler

                                              description  price  \
0       'Libanese hummus topped off with mango chutney...   6.95
1                                                           6.95
2       'Homemade sourdough pita bread filled with sal...  12.95
3       'Homemade sourdough pita bread filled with sal...  13.95
4       'Homemade sourdough pita bread filled with sal...  14.95
...                                                   ...    ...
403008                                                      2.50
403009                                                      2.10
403010                                                      2.00
403011                                                      3.55
403012                                                      2.45

       alcoholContent caffeineContent
0                   0               0
1                   0               0
2                   0               0
3                   0               0
4                   0               0
...               ...             ...
403008              0               0
403009              0               0
403010              0               0
403011              0               0
403012              0               0

[403013 rows x 7 columns]

Tabla locations to restaurants

In [11]:
query5 = """SELECT *
            FROM locations_to_restaurants
           ;
            """ 

df_5 = pd.read_sql_query (query5, conn) 
print(df_5)

                restaurant_id  location_id
0       chitir-chicken-ninove            0
1                      hkebab            0
2                juicy-ninove            0
3                       samis            0
4                   josephine            0
...                       ...          ...
157804           frituur-snax         2504
157805             pitta-dorp         2504
157806    nino-grill-ninove-1         2504
157807         the-salad-spot         2504
157808                  titis         2504

[157809 rows x 2 columns]

Tabla locations

In [12]:
query6 = """SELECT *
            FROM locations
           ;
            """ 

df_6 = pd.read_sql_query (query6, conn) 
print(df_6)

        ID  postalCode   latitude  longitude               city  \
0        0        9400  50.792164   4.052104         Lieferinge
1        1        9620  50.872532   3.832819        Grotenberge
2        2        9500  50.775885   3.869852       Nederboelare
3        3        9120  51.213449   4.257383            Beveren
4        4        2845  51.109645   4.327743               Niel
...    ...         ...        ...        ...                ...
2500  2500        9680  50.816185   3.653858          Maarkedal
2501  2501        9470  50.877341   4.065128        Denderleeuw
2502  2502        1755  50.773008   4.063802           Oetingen
2503  2503        8660  51.101270   2.591424           De Panne
2504  2504        9400  50.818995   3.966288  Appelterre-Eichem

                                         name
0                       Onze-Lieve-Vrouwekerk
1     Sint-Petrusbanden en Sint-Berlindiskerk
2                          Sint-Machariuskerk
3                           Sint-Martinuskerk
4                        Onze-Lieve-Vrouwkerk
...                                       ...
2500                                Het Marca
2501            Onze-Lieve-Vrouw ter Noodkerk
2502                        Sint-Ursmaruskerk
2503                     Onze-Lieve-Vrouwkerk
2504                       Sint-Gertrudiskerk

[2505 rows x 6 columns]